# Урок № 9, задание 1
n=int(input('Введите количество (N) чисел (от 1 до 100000): '))
m=list(map(int, input('Введите N чисел через пробел, каждое не превышает 2*10e9 по модулю: ').split()))
num=set(m)
print('Количество различных чисел среди данных: ', len(num))
# как проконтролировать введение 100000 (N) чисел через пробел? Проблематично. Копированием извне(из файла)


# Урок № 9, задание 2
a1=list(map(int, input('Введите числа для первого списка: ').split()))
a2=list(map(int, input('Введите числа для второго списка: ').split()))
print('Количество чисел содержащихся одновременно как в первом списке, так и во втором: ', (len(a1)+len(a2))) # Это если речь про списки
mnj=set(a1+a2) # Если про множества
print('Количество уникальных (не повторяющихся) чисел, содержащихся одновременно как в первом списке, так и во втором: ', len(mnj))


# Урок № 9, задание 3
N=list(map(int, input('Введите числа через пробел: ').split()))
res=set()
for i in N:
    if i in res:
        print('YES')
    else:
        res.add(i)
        print('NO')