# Урок № 6, задание1
n=int(input('Введите целое число: '))
ch=0
for i in range(n):
    i=int(input('Число '))
    if i==0:
        ch+=1
print('Всего нулей: ', ch)


# Урок № 6, задание 2
num=int(input('Введите натуральное число (не более 2млрд): '))
n=0
for i in range(1,num+1):
    if num%i==0:
        n+=1
print('Количество натуральных делителей введённого числа: ', n)


# Урок № 6, задание 3
a=int(input('Введите целое число А: '))
b=int(input('Введите целое число В (В больше, либо равно А): '))
for i in range(a,b+1): # Четные числа включая В или нет? Я посчитала, что нужно включить В, вдруг оно четное
    if i%2==0:
        print(i, end=' ')

